Git/GitTips.org
**** Create feature branch from command line

| git branch -vv                                                    | To find out which remote branch your local branch is tracking, command to give tracking branch                                                                                                           |
| git status -sb                                                    | To find out which remote branch your local branch is tracking, command to give tracking branch                                                                                                           |

| git remote update                                                 | command to update remote branches                                                                                                                                                                        |
| git remote update --prune                                         | command to update remote branches. This will remove all remote branches which you have a local record of, but are no longer actually present on the remote.                                              |

| git branch -m <newname>                                           | To rename the current local branch                                                                                                                                                                       |
| git branch (local branch name) -u (remote branch name)            | To point local branch to a different remote branch                                                                                                                                                       |
| git branch -a                                                     | command to list all branches                                                                                                                                                                             |
| git branch -r                                                     | Remote branches only.                                                                                                                                                                                    |
| git branch -l or `git branch`                                     | Local branches only.                                                                                                                                                                                     |

| git checkout -b feature/testFeatureBranch remotes/origin/develop` | To start a feature branch from command line, simply create a new branch from remotes/origin/develop                                                                                                     |
| git checkout localBranch1                                         | To find out which remote branch your local branch is tracking,                                                                                                                                           |
| git checkout localBranch2                                         | To find out which remote branch your local branch is tracking,                                                                                                                                           |

| git status                      | To see the status of the local repository                                                                                                                                                                                            |
| git diff filename.txt           | command to show changes in a specific file. command to see what you haven't "git add"ed yet                                                                                                                                          |
| git diff --word-diff myfile.txt | Instead of showing you two lines for each change, Git allows you to highlight changes in a line explicitly. (The result is usually colored nicely, the removed part being red and the added text green.)                             |
| git diff --cached myfile.txt    | command to see already "-add" ed changes                                                                                                                                                                                             |
| git add -A` or `git add .`      | To stage all changed files                                                                                                                                                                                                           |
| git add (fileName)`             | To stage individual changed files                                                                                                                                                                                                    |
| git checkout                    | To copy a file from some other commit to your current working tree. It doesn't automatically commit the file. (Switch branches or restore working tree files)                                                                        |
| git checkout fileName           | Command to undo changes to a single file in working directory                                                                                                                                                                        |
| git commit -m "commit message"  | To commit with a custom message                                                                                                                                                                                                      |
| git stash -u                    | command to undo all changes                                                                                                                                                                                                          |
| GIT LOG --ONELINE               | To view recent commit messages                                                                                                                                                                                                       |
| git push                        | To push the commits to an upsteam remote branch                                                                                                                                                                                      |
| git revert                      | To undo a previous commit. In git, you can't alter or erase an earlier commit. (Actually you can, but it can cause problems.) So instead of editing the earlier commit, revert introduces a new commit that reverses an earlier one. |

When doing a diff on a long line, this can be very helpful but you'll still get a less-like scrolling output that can be unhandy to use. You maybe just want the diff put into your terminal:

   #+BEGIN_EXAMPLE
   `PAGER='' git diff --word-diff myfile.txt`
   #+END_EXAMPLE

| git reset                                        | To undo changes in your working directory that haven't been comitted yet                                                                                                                                                                                                                                                                                                                                  |
| git reset --mixed HEAD file.txt                  | it essentially just takes whatever file.txt looks like in HEAD and puts that in the Index                                                                                                                                                                                                                                                                                                                 |
| git reset HEAD~                                  | If you do not want to push your commit to remote branch                                                                                                                                                                                                                                                                                                                                                   |
| git reset HEAD~                                  | To undo previous commits that you don't want to push                                                                                                                                                                                                                                                                                                                                                      |
| git reset --hard HEAD~                           | (You undid your last commit, all the git adds, and all the work you did in your working directory.)                                                                                                                                                                                                                                                                                                       |
| git reset --hard origin/master<remotebranchname> | master branch and 'origin/master' have diverged, how to 'undiverge' branches'                                                                                                                                                                                                                                                                                                                             |
| git reset --soft HEAD~                           | (When you reset back to HEAD~ (the parent of HEAD), you are moving the branch back to where it was without changing the Index (staging area) or Working Directory. You could now do a bit more work and commit again to accomplish basically what git commit --amend would have done. Note that if you run git status now you'll see in green the difference between the Index and what the new HEAD is.) |
| git reset --mixed HEAD~                          | It still undid your last commit, but also unstaged everything. You rolled back to before you ran all your git adds AND git commit.                                                                                                                                                                                                                                                                        |

| git clean                                                            | To remove local untracked files from the current Git branch                                    |
| git clean -n                                                         | To see which files will be deleted you can use the -n option before you run the actual command |
| git clean -f                                                         | When you are comfortable (because it will delete the files for real!) use the -f option        |
| git clean -f -d or git clean -fd                                     | To remove directories                                                                          |
| git clean -f -X or git clean -fX (Note the case difference on the X) | To remove ignored files                                                                        |
| git clean -f -x or git clean -fx (Note the case difference on the X) | To remove ignored and non-ignored files                                                        |

-------------------------------------------------------

GIT: SEE ALL UNPUSHED COMMITS OR COMMITS THAT ARE NOT IN ANOTHER BRANCH

| git cherry -v                   | If you need to find out which of your local commits are not on the remote server do this. The -v option prints out the commit messages. Without it you will see only the SHA1 codes.                   |
| git cherry -v origin/somebranch | You may also compare against another (upstream) branch like that. This tool is especially useful when you have a ton of commits after a merge and want to know the commit differences between branches |
| git show (COMMIT_HASH)          | Once you have the list from the command above, use this to see the files that changed in each commit                                                                                                   |

---------------------------------------------------
    
