Git/GitTips.md


<a id="org1c26b87"></a>

## Create feature branch from command line

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git branch -vv</td>
<td class="org-left">To find out which remote branch your local branch is tracking, command to give tracking branch</td>
</tr>


<tr>
<td class="org-left">git status -sb</td>
<td class="org-left">To find out which remote branch your local branch is tracking, command to give tracking branch</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git remote update</td>
<td class="org-left">command to update remote branches</td>
</tr>


<tr>
<td class="org-left">git remote update &#x2013;prune</td>
<td class="org-left">command to update remote branches. This will remove all remote branches which you have a local record of, but are no longer actually present on the remote.</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git branch -m &lt;newname&gt;</td>
<td class="org-left">To rename the current local branch</td>
</tr>


<tr>
<td class="org-left">git branch (local branch name) -u (remote branch name)</td>
<td class="org-left">To point local branch to a different remote branch</td>
</tr>


<tr>
<td class="org-left">git branch -a</td>
<td class="org-left">command to list all branches</td>
</tr>


<tr>
<td class="org-left">git branch -r</td>
<td class="org-left">Remote branches only.</td>
</tr>


<tr>
<td class="org-left">git branch -l or `git branch`</td>
<td class="org-left">Local branches only.</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git checkout -b feature/testFeatureBranch remotes/origin/develop`</td>
<td class="org-left">To start a feature branch from command line, simply create a new branch from remotes/origin/develop</td>
</tr>


<tr>
<td class="org-left">git checkout localBranch1</td>
<td class="org-left">To find out which remote branch your local branch is tracking,</td>
</tr>


<tr>
<td class="org-left">git checkout localBranch2</td>
<td class="org-left">To find out which remote branch your local branch is tracking,</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git status</td>
<td class="org-left">To see the status of the local repository</td>
</tr>


<tr>
<td class="org-left">git diff filename.txt</td>
<td class="org-left">command to show changes in a specific file. command to see what you haven't "git add"ed yet</td>
</tr>


<tr>
<td class="org-left">git diff &#x2013;word-diff myfile.txt</td>
<td class="org-left">Instead of showing you two lines for each change, Git allows you to highlight changes in a line explicitly. (The result is usually colored nicely, the removed part being red and the added text green.)</td>
</tr>


<tr>
<td class="org-left">git diff &#x2013;cached myfile.txt</td>
<td class="org-left">command to see already "-add" ed changes</td>
</tr>


<tr>
<td class="org-left">git add -A` or `git add .`</td>
<td class="org-left">To stage all changed files</td>
</tr>


<tr>
<td class="org-left">git add (fileName)`</td>
<td class="org-left">To stage individual changed files</td>
</tr>


<tr>
<td class="org-left">git checkout</td>
<td class="org-left">To copy a file from some other commit to your current working tree. It doesn't automatically commit the file. (Switch branches or restore working tree files)</td>
</tr>


<tr>
<td class="org-left">git checkout fileName</td>
<td class="org-left">Command to undo changes to a single file in working directory</td>
</tr>


<tr>
<td class="org-left">git commit -m "commit message"</td>
<td class="org-left">To commit with a custom message</td>
</tr>


<tr>
<td class="org-left">git stash -u</td>
<td class="org-left">command to undo all changes</td>
</tr>


<tr>
<td class="org-left">GIT LOG &#x2013;ONELINE</td>
<td class="org-left">To view recent commit messages</td>
</tr>


<tr>
<td class="org-left">git push</td>
<td class="org-left">To push the commits to an upsteam remote branch</td>
</tr>


<tr>
<td class="org-left">git revert</td>
<td class="org-left">To undo a previous commit. In git, you can't alter or erase an earlier commit. (Actually you can, but it can cause problems.) So instead of editing the earlier commit, revert introduces a new commit that reverses an earlier one.</td>
</tr>
</tbody>
</table>

When doing a diff on a long line, this can be very helpful but you'll still get a less-like scrolling output that can be unhandy to use. You maybe just want the diff put into your terminal:

    `PAGER='' git diff --word-diff myfile.txt`

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git reset</td>
<td class="org-left">To undo changes in your working directory that haven't been comitted yet</td>
</tr>


<tr>
<td class="org-left">git reset &#x2013;mixed HEAD file.txt</td>
<td class="org-left">it essentially just takes whatever file.txt looks like in HEAD and puts that in the Index</td>
</tr>


<tr>
<td class="org-left">git reset HEAD~</td>
<td class="org-left">If you do not want to push your commit to remote branch</td>
</tr>


<tr>
<td class="org-left">git reset HEAD~</td>
<td class="org-left">To undo previous commits that you don't want to push</td>
</tr>


<tr>
<td class="org-left">git reset &#x2013;hard HEAD~</td>
<td class="org-left">(You undid your last commit, all the git adds, and all the work you did in your working directory.)</td>
</tr>


<tr>
<td class="org-left">git reset &#x2013;hard origin/master&lt;remotebranchname&gt;</td>
<td class="org-left">master branch and 'origin/master' have diverged, how to 'undiverge' branches'</td>
</tr>


<tr>
<td class="org-left">git reset &#x2013;soft HEAD~</td>
<td class="org-left">(When you reset back to HEAD~ (the parent of HEAD), you are moving the branch back to where it was without changing the Index (staging area) or Working Directory. You could now do a bit more work and commit again to accomplish basically what git commit &#x2013;amend would have done. Note that if you run git status now you'll see in green the difference between the Index and what the new HEAD is.)</td>
</tr>


<tr>
<td class="org-left">git reset &#x2013;mixed HEAD~</td>
<td class="org-left">It still undid your last commit, but also unstaged everything. You rolled back to before you ran all your git adds AND git commit.</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git clean</td>
<td class="org-left">To remove local untracked files from the current Git branch</td>
</tr>


<tr>
<td class="org-left">git clean -n</td>
<td class="org-left">To see which files will be deleted you can use the -n option before you run the actual command</td>
</tr>


<tr>
<td class="org-left">git clean -f</td>
<td class="org-left">When you are comfortable (because it will delete the files for real!) use the -f option</td>
</tr>


<tr>
<td class="org-left">git clean -f -d or git clean -fd</td>
<td class="org-left">To remove directories</td>
</tr>


<tr>
<td class="org-left">git clean -f -X or git clean -fX (Note the case difference on the X)</td>
<td class="org-left">To remove ignored files</td>
</tr>


<tr>
<td class="org-left">git clean -f -x or git clean -fx (Note the case difference on the X)</td>
<td class="org-left">To remove ignored and non-ignored files</td>
</tr>
</tbody>
</table>

---

GIT: SEE ALL UNPUSHED COMMITS OR COMMITS THAT ARE NOT IN ANOTHER BRANCH

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">git cherry -v</td>
<td class="org-left">If you need to find out which of your local commits are not on the remote server do this. The -v option prints out the commit messages. Without it you will see only the SHA1 codes.</td>
</tr>


<tr>
<td class="org-left">git cherry -v origin/somebranch</td>
<td class="org-left">You may also compare against another (upstream) branch like that. This tool is especially useful when you have a ton of commits after a merge and want to know the commit differences between branches</td>
</tr>


<tr>
<td class="org-left">git show (COMMIT<sub>HASH</sub>)</td>
<td class="org-left">Once you have the list from the command above, use this to see the files that changed in each commit</td>
</tr>
</tbody>
</table>

---
