Git/GitTips.org
*** Undoing a git push

You need to make sure that no other users of this repository are fetching the incorrect changes or trying to build on top of the commits that you want removed because you are about to rewind history.

Then you need to 'force' push the old reference.

   #+BEGIN_EXAMPLE
   `git push -f origin last_known_good_commit:branch_name`
   #+END_EXAMPLE

e.g.

   #+BEGIN_EXAMPLE
   `git push -f origin cc4b63bebb6:alpha-0.3.0`
   #+END_EXAMPLE

------------------------------------------------

*** Undo a commit and redo

   #+BEGIN_EXAMPLE
    $ git commit -m "Something terribly misguided"              (1)
    
    $ git reset HEAD~                                           (2)
    
    << edit files as necessary >>                               (3)
    
    $ git add ...                                               (4)
    
    $ git commit -c ORIG_HEAD                                   (5)
   #+END_EXAMPLE

1. This is what you want to undo
2. This leaves your working tree (the state of your files on disk) unchanged but undoes the commit and leaves the changes you  committed unstaged (so they'll appear as "Changes not staged for commit" in git status, and you'll need to add them again before committing). If you only want to add more changes to the previous commit, or change the commit message1, you could use git reset --soft HEAD~ instead, which is like git reset HEAD~ (where HEAD~ is the same as HEAD~1) but leaves your existing changes staged.
3. Make corrections to working tree files.
4. git add anything that you want to include in your new commit.
5. Commit the changes, reusing the old commit message. reset copied the old head to .git/ORIG_HEAD; commit with -c ORIG_HEAD will open an editor, which initially contains the log message from the old commit and allows you to edit it. If you do not need to edit the message, you could use the -C option.

-------------------------------------------------------

If the commit you want to fix isn’t the most recent one:

   #+BEGIN_EXAMPLE
   git rebase --interactive $parent_of_flawed_commit (after the git log command, if you want to edit the fifth commit, then enter the name of the sixth commit in this command.)
   #+END_EXAMPLE
 
If you want to fix several flawed commits, pass the parent of the oldest one of them.

   #+BEGIN_EXAMPLE
   An editor will come up, with a list of all commits since the one you gave.
   Change pick to reword (or on old versions of Git, to edit) in front of any commits you want to fix.
   Once you save, Git will replay the listed commits.
   #+END_EXAMPLE
 
For each commit you want to reword, Git will drop you back into your editor. For each commit you want to edit, Git drops you into the shell. If you’re in the shell:

   #+BEGIN_EXAMPLE
   Change the commit in any way you like.
   git commit --amend
   git rebase --continue
   #+END_EXAMPLE

Most of this sequence will be explained to you by the output of the various commands as you go. It’s very easy, you don’t need to memorise it – just remember that git rebase --interactive lets you correct commits no matter how long ago they were.

-----------------------------------------------------------

*** Authentication issues

    If you need to set the username and password, use this command:
   #+BEGIN_EXAMPLE
   git remote set-url origin https://<username>:<password>@github.com/<details-about-the-repository>.git
   #+END_EXAMPLE

    $ git pull
    
    Permission denied (publickey).
    fatal: Could not read from remote repository.
    Please make sure you have the correct access rights and the repository exists.
    A "Permission denied" error means that the server rejected your connection. 
    
    Resolution 1 : 
   #+BEGIN_EXAMPLE
   git remote set-url origin https://n0281526@git.forge.lmig.com/scm/uscm-esales/services-policywriting.git
   #+END_EXAMPLE
    
    
    Resolution 2 : 
    
    If you generated the keys yourself from your client machine, do not forget to add them to the SSH agent using the command "ssh-add".
    Run ssh-add on the client machine, that will add the SSH key to the agent. 
    
    To figure out where your client's SSH agent is looking for private and public keys, use this command:
   #+BEGIN_EXAMPLE
   ssh -vT git@github.com
   #+END_EXAMPLE
    
    This will show the list of the directories that your computer's SSH agent is looking in for public and private keys.
    If everything looks good with this command, you are pretty much set to push and pull from the remote repositories.
    
    You can change the protocol that your local repository is using to communicate with the remote repository :
    It can be HTTPS or SSH.
    The issue with using HTTPS URL is, every time you want to push a change, it might ask you for username and password.
    With SSH, you don't have to enter username and password every single time.
    
    Use these commands to switch between the two :
    
    1. If you want to use HTTPS
    
      #+BEGIN_EXAMPLE
      git remote set-url origin https://github.com/USERNAME/REPOSITORY.git
      #+END_EXAMPLE

      If you got authentication issues with the GIT console you can try your auth this way:
      #+BEGIN_EXAMPLE
      https://<username>:<password>@bitbucket.org/<username>/<repo>.git
      #+END_EXAMPLE
    
    2. If you want to use SSH

      #+BEGIN_EXAMPLE
      git remote set-url origin git@github.com:USERNAME/REPOSITORY.git
      #+END_EXAMPLE

      And then run this:
      
      #+BEGIN_EXAMPLE
      ssh-keygen -t rsa -b 4096 -C "explorer436@tutanota.com"
      #+END_EXAMPLE

      (When you're prompted to "Enter a file in which to save the key," 
      press Enter. This accepts the default file location.) Now add this SSH ket to bitbucket server.
    
      If you want to add an SSH key generated from Git console to the ssh-agent in your computer : 

      You might need to start ssh-agent before you run the ssh-add command: 
      #+BEGIN_EXAMPLE
      eval `ssh-agent -s` or eval $(ssh-agent)
      #+END_EXAMPLE

      Add your SSH private key to the ssh-agent using the following command:
      #+BEGIN_EXAMPLE
      ssh-add  ~/Downloads/CloudForgeGitSSHKeys/id_rsa
      #+END_EXAMPLE
      (this should point to the location of the private key file)

-----------------------------------------------------------

*** Helpful Resources
    
    https://www.atlassian.com/git/tutorials/merging-vs-rebasing 

